/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _DEVBUS_DCR__H_ // Prevent multiple inclusion
#define   _DEVBUS_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define DEVBUS_DCR_base    (0x0CC000)  // Base address for all instances
#define DEVBUS_DCR_size    (0x003C)    // Size of instance (largest offset + 1 )
  
#define DEVBUS_DCR(reg) _DCR_REG(DEVBUS_DCR, reg)
  
// Register:

#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_WR_SIZE_get(x)       _BGQ_GET(2,61,x)
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_WR_SIZE_set(v)       _BGQ_SET(2,61,v)
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_WR_SIZE_insert(x,v)  _BGQ_INSERT(2,61,x,v)


#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_RD_SIZE_width        2
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_RD_SIZE_position     63
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_RD_SIZE_get(x)       _BGQ_GET(2,63,x)
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_RD_SIZE_set(v)       _BGQ_SET(2,63,v)
#define DEVBUS_DCR__DB_INTERRUPT_STATE_CONTROL_HIGH__PCIE_CFGIO_RD_SIZE_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0021) // Offset of Control register in instance

#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define DEVBUS_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct devbus_dcr { 
    /* 0x0000 */ uint64_t devbus_control;
    /* 0x0001 */ uint64_t devbus_debug;
    /* 0x0002 */ uint64_t devbus_peek;
    /* 0x0003 */ uint64_t pcie_cfg;
    /* 0x0004 */ uint64_t switch_cfg;
    /* 0x0005 */ uint64_t spare;
    /* 0x0006 */ uint64_t reserve_0006[0x000A];
    /* 0x0010 */ uint64_t db_interrupt_state__state;
    /* 0x0011 */ uint64_t db_interrupt_state_control_low;
    /* 0x0012 */ uint64_t db_interrupt_state_control_high;
    /* 0x0013 */ uint64_t db_interrupt_state__force;
    /* 0x0014 */ uint64_t db_interrupt_state__first;
    /* 0x0015 */ uint64_t db_interrupt_state__machine_check;
    /* 0x0016 */ uint64_t db_interrupt_state__critical;
    /* 0x0017 */ uint64_t db_interrupt_state__noncritical;
    /* 0x0018 */ uint64_t reserve_0018[0x0008];
    /* 0x0020 */ uint64_t interrupt_internal_error__state;
    /* 0x0021 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0022 */ uint64_t interrupt_internal_error__force;
    /* 0x0023 */ uint64_t interrupt_internal_error__first;
    /* 0x0024 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0025 */ uint64_t interrupt_internal_error__critical;
    /* 0x0026 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0027 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0028 */ uint64_t interrupt_internal_error_hw_info;
    /* 0x0029 */ uint64_t interrupt_internal_error_data_info;
    /* 0x002A */ uint64_t reserve_002A[0x0006];
    /* 0x0030 */ uint64_t upc_db_counter[DEVBUS_DCR__UPC_DB_COUNTER_range];
    /* 0x0037 */ uint64_t reserve_0037;
    /* 0x0038 */ uint64_t upc_db_counter_control_rw;
    /* 0x0039 */ uint64_t upc_db_counter_control_w1s;
    /* 0x003A */ uint64_t upc_db_counter_control_w1c;
    /* 0x003B */ uint64_t upc_db_config;
} devbus_dcr_t;
  
#define DEVBUS_DCR_USER_PTR _DCR_USER_PTR(devbus_dcr_t, DEVBUS_DCR)
#define DEVBUS_DCR_PRIV_PTR _DCR_PRIV_PTR(devbus_dcr_t, DEVBUS_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
