/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _GEA_DCR__H_ // Prevent multiple inclusion
#define   _GEA_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define GEA_DCR_base    (0x0)  // Base address for all instances
#define GEA_DCR_size    (0x0063)    // Size of instance (largest offset + 1 )
  
#define GEA_DCR(reg) _DCR_REG(GEA_DCR, reg)
  
// Register:
//   Name:        gea_interrupt_map0

#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER2_INT_width        2
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER2_INT_position     9
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER2_INT_get(x)       _BGQ_GET(2,9,x)
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER2_INT_set(v)       _BGQ_SET(2,9,v)
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER2_INT_insert(x,v)  _BGQ_INSERT(2,9,x,v)


#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER3_INT_width        2
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER3_INT_position     11
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER3_INT_get(x)       _BGQ_GET(2,11,x)
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER3_INT_set(v)       _BGQ_SET(2,11,v)
#define GEA_DCR__GEA_INTERRUPT_STATE_CONTROL_HIGH__TIMER3_INT_insert(x,v)  _BGQ_INSERT(2,11,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged Only
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x005B) // Offset of Control register in instance

#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define GEA_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct gea_dcr { 
    /* 0x0000 */ uint64_t gea_interrupt_map0;
    /* 0x0001 */ uint64_t gea_interrupt_map1;
    /* 0x0002 */ uint64_t gea_interrupt_map2;
    /* 0x0003 */ uint64_t gea_interrupt_map3;
    /* 0x0004 */ uint64_t gea_interrupt_map4;
    /* 0x0005 */ uint64_t gea_interrupt_map5;
    /* 0x0006 */ uint64_t gea_interrupt_map6;
    /* 0x0007 */ uint64_t gea_interrupt_map7;
    /* 0x0008 */ uint64_t gea_interrupt_map8;
    /* 0x0009 */ uint64_t gea_interrupt_map9;
    /* 0x000A */ uint64_t gea_interrupt_status0;
    /* 0x000B */ uint64_t gea_interrupt_status1;
    /* 0x000C */ uint64_t gea_interrupt_status2;
    /* 0x000D */ uint64_t gea_mapped_interrupt_status0_0;
    /* 0x000E */ uint64_t gea_mapped_interrupt_status0_1;
    /* 0x000F */ uint64_t gea_mapped_interrupt_status0_2;
    /* 0x0010 */ uint64_t gea_mapped_interrupt_status1_0;
    /* 0x0011 */ uint64_t gea_mapped_interrupt_status1_1;
    /* 0x0012 */ uint64_t gea_mapped_interrupt_status1_2;
    /* 0x0013 */ uint64_t gea_mapped_interrupt_status2_0;
    /* 0x0014 */ uint64_t gea_mapped_interrupt_status2_1;
    /* 0x0015 */ uint64_t gea_mapped_interrupt_status2_2;
    /* 0x0016 */ uint64_t gea_mapped_interrupt_status3_0;
    /* 0x0017 */ uint64_t gea_mapped_interrupt_status3_1;
    /* 0x0018 */ uint64_t gea_mapped_interrupt_status3_2;
    /* 0x0019 */ uint64_t gea_mapped_interrupt_status4_0;
    /* 0x001A */ uint64_t gea_mapped_interrupt_status4_1;
    /* 0x001B */ uint64_t gea_mapped_interrupt_status4_2;
    /* 0x001C */ uint64_t gea_mapped_interrupt_status5_0;
    /* 0x001D */ uint64_t gea_mapped_interrupt_status5_1;
    /* 0x001E */ uint64_t gea_mapped_interrupt_status5_2;
    /* 0x001F */ uint64_t gea_mapped_interrupt_status6_0;
    /* 0x0020 */ uint64_t gea_mapped_interrupt_status6_1;
    /* 0x0021 */ uint64_t gea_mapped_interrupt_status6_2;
    /* 0x0022 */ uint64_t gea_mapped_interrupt_status7_0;
    /* 0x0023 */ uint64_t gea_mapped_interrupt_status7_1;
    /* 0x0024 */ uint64_t gea_mapped_interrupt_status7_2;
    /* 0x0025 */ uint64_t gea_mapped_interrupt_status8_0;
    /* 0x0026 */ uint64_t gea_mapped_interrupt_status8_1;
    /* 0x0027 */ uint64_t gea_mapped_interrupt_status8_2;
    /* 0x0028 */ uint64_t gea_mapped_interrupt_status9_0;
    /* 0x0029 */ uint64_t gea_mapped_interrupt_status9_1;
    /* 0x002A */ uint64_t gea_mapped_interrupt_status9_2;
    /* 0x002B */ uint64_t gea_mapped_interrupt_status10_0;
    /* 0x002C */ uint64_t gea_mapped_interrupt_status10_1;
    /* 0x002D */ uint64_t gea_mapped_interrupt_status10_2;
    /* 0x002E */ uint64_t gea_mapped_interrupt_status11_0;
    /* 0x002F */ uint64_t gea_mapped_interrupt_status11_1;
    /* 0x0030 */ uint64_t gea_mapped_interrupt_status11_2;
    /* 0x0031 */ uint64_t gea_mapped_interrupt_status12_0;
    /* 0x0032 */ uint64_t gea_mapped_interrupt_status12_1;
    /* 0x0033 */ uint64_t gea_mapped_interrupt_status12_2;
    /* 0x0034 */ uint64_t gea_mapped_interrupt_status13_0;
    /* 0x0035 */ uint64_t gea_mapped_interrupt_status13_1;
    /* 0x0036 */ uint64_t gea_mapped_interrupt_status13_2;
    /* 0x0037 */ uint64_t gea_mapped_interrupt_status14_0;
    /* 0x0038 */ uint64_t gea_mapped_interrupt_status14_1;
    /* 0x0039 */ uint64_t gea_mapped_interrupt_status14_2;
    /* 0x003A */ uint64_t gea_mapped_interrupt_status15_0;
    /* 0x003B */ uint64_t gea_mapped_interrupt_status15_1;
    /* 0x003C */ uint64_t gea_mapped_interrupt_status15_2;
    /* 0x003D */ uint64_t gea_debug_control;
    /* 0x003E */ uint64_t reserve_003E[0x0002];
    /* 0x0040 */ uint64_t timer0_config;
    /* 0x0041 */ uint64_t reserve_0041;
    /* 0x0042 */ uint64_t timer0;
    /* 0x0043 */ uint64_t reserve_0043;
    /* 0x0044 */ uint64_t timer1_config;
    /* 0x0045 */ uint64_t reserve_0045;
    /* 0x0046 */ uint64_t timer1;
    /* 0x0047 */ uint64_t reserve_0047;
    /* 0x0048 */ uint64_t timer2_config;
    /* 0x0049 */ uint64_t reserve_0049;
    /* 0x004A */ uint64_t timer2;
    /* 0x004B */ uint64_t reserve_004B;
    /* 0x004C */ uint64_t timer3_config;
    /* 0x004D */ uint64_t reserve_004D;
    /* 0x004E */ uint64_t timer3;
    /* 0x004F */ uint64_t reserve_004F;
    /* 0x0050 */ uint64_t gea_interrupt_state__state;
    /* 0x0051 */ uint64_t gea_interrupt_state_control_low;
    /* 0x0052 */ uint64_t gea_interrupt_state_control_high;
    /* 0x0053 */ uint64_t gea_interrupt_state__force;
    /* 0x0054 */ uint64_t gea_interrupt_state__first;
    /* 0x0055 */ uint64_t gea_interrupt_state__machine_check;
    /* 0x0056 */ uint64_t gea_interrupt_state__critical;
    /* 0x0057 */ uint64_t gea_interrupt_state__noncritical;
    /* 0x0058 */ uint64_t reserve_0058[0x0002];
    /* 0x005A */ uint64_t interrupt_internal_error__state;
    /* 0x005B */ uint64_t interrupt_internal_error_control_high;
    /* 0x005C */ uint64_t interrupt_internal_error__force;
    /* 0x005D */ uint64_t interrupt_internal_error__first;
    /* 0x005E */ uint64_t interrupt_internal_error__machine_check;
    /* 0x005F */ uint64_t interrupt_internal_error__critical;
    /* 0x0060 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0061 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0062 */ uint64_t interrupt_internal_error_hw_info;
} gea_dcr_t;
  
#define GEA_DCR_USER_PTR _DCR_USER_PTR(gea_dcr_t, GEA_DCR)
#define GEA_DCR_PRIV_PTR _DCR_PRIV_PTR(gea_dcr_t, GEA_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
