/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _L2_DCR__H_ // Prevent multiple inclusion
#define   _L2_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define L2_DCR_base    (0x100000)  // Base address for all instances
#define L2_DCR_size    (0x0111)    // Size of instance (largest offset + 1 )
#define L2_DCR_stride  (0x4000)    // Distance between instances

#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__OVERLOCK_width        2
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__OVERLOCK_position     37
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__OVERLOCK_get(x)       _BGQ_GET(2,37,x)
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__OVERLOCK_set(v)       _BGQ_SET(2,37,v)
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__OVERLOCK_insert(x,v)  _BGQ_INSERT(2,37,x,v)


#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__UPC_COUNTER_OVF_width        2
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__UPC_COUNTER_OVF_position     39
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__UPC_COUNTER_OVF_get(x)       _BGQ_GET(2,39,x)
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__UPC_COUNTER_OVF_set(v)       _BGQ_SET(2,39,v)
#define L2_DCR__L2_INTERRUPT_STATE_CONTROL_HIGH__UPC_COUNTER_OVF_insert(x,v)  _BGQ_INSERT(2,39,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0109) // Offset of Control register in instance

#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define L2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct l2_dcr { 
    /* 0x0000 */ uint64_t upc_l2_counter[L2_DCR__UPC_L2_COUNTER_range];
    /* 0x0010 */ uint64_t upc_l2_counter_control_rw;
    /* 0x0011 */ uint64_t upc_l2_counter_control_w1s;
    /* 0x0012 */ uint64_t upc_l2_counter_control_w1c;
    /* 0x0013 */ uint64_t upc_l2_config;
    /* 0x0014 */ uint64_t ctrl;
    /* 0x0015 */ uint64_t status;
    /* 0x0016 */ uint64_t replpol;
    /* 0x0017 */ uint64_t refctrl;
    /* 0x0018 */ uint64_t lructrl0;
    /* 0x0019 */ uint64_t lructrl1;
    /* 0x001A */ uint64_t reserve_001A[0x0006];
    /* 0x0020 */ uint64_t confl_stat[L2_DCR__CONFL_STAT_range];
    /* 0x0030 */ uint64_t backaddr;
    /* 0x0031 */ uint64_t backdata;
    /* 0x0032 */ uint64_t reserve_0032[0x00CE];
    /* 0x0100 */ uint64_t l2_interrupt_state__state;
    /* 0x0101 */ uint64_t l2_interrupt_state_control_low;
    /* 0x0102 */ uint64_t l2_interrupt_state_control_high;
    /* 0x0103 */ uint64_t l2_interrupt_state__force;
    /* 0x0104 */ uint64_t l2_interrupt_state__first;
    /* 0x0105 */ uint64_t l2_interrupt_state__machine_check;
    /* 0x0106 */ uint64_t l2_interrupt_state__critical;
    /* 0x0107 */ uint64_t l2_interrupt_state__noncritical;
    /* 0x0108 */ uint64_t interrupt_internal_error__state;
    /* 0x0109 */ uint64_t interrupt_internal_error_control_high;
    /* 0x010A */ uint64_t interrupt_internal_error__force;
    /* 0x010B */ uint64_t interrupt_internal_error__first;
    /* 0x010C */ uint64_t interrupt_internal_error__machine_check;
    /* 0x010D */ uint64_t interrupt_internal_error__critical;
    /* 0x010E */ uint64_t interrupt_internal_error__noncritical;
    /* 0x010F */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0110 */ uint64_t interrupt_internal_error_hw_info;
} l2_dcr_t;
  
#define L2_DCR_USER_PTR(i) _DCR_USER_PTR__INDEX(l2_dcr_t, L2_DCR, i)
#define L2_DCR_PRIV_PTR(i) _DCR_PRIV_PTR__INDEX(l2_dcr_t, L2_DCR, i)
  
#define L2_DCR_USER_PTR__Core00 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core00)
#define L2_DCR_USER_PTR__Core01 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core01)
#define L2_DCR_USER_PTR__Core02 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core02)
#define L2_DCR_USER_PTR__Core03 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core03)
#define L2_DCR_USER_PTR__Core04 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core04)
#define L2_DCR_USER_PTR__Core05 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core05)
#define L2_DCR_USER_PTR__Core06 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core06)
#define L2_DCR_USER_PTR__Core07 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core07)
#define L2_DCR_USER_PTR__Core08 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core08)
#define L2_DCR_USER_PTR__Core09 _DCR_USER_PTR__NAME(l2_dcr_t, L2_DCR, Core09)
