/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _MU_DCR__H_ // Prevent multiple inclusion
#define   _MU_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define MU_DCR_base    (0x0E0000)  // Base address for all instances
#define MU_DCR_size    (0x0F45)    // Size of instance (largest offset + 1 )
  
#define MU_DCR(reg) _DCR_REG(MU_DCR, reg)
  
// Register:
//   Name:        imfifo_thold_int_en

#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER1_get(x)       _BGQ_GET(2,3,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER1_set(v)       _BGQ_SET(2,3,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER1_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER2_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER2_position     5
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER2_get(x)       _BGQ_GET(2,5,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER2_set(v)       _BGQ_SET(2,5,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER2_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER3_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER3_position     7
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER3_get(x)       _BGQ_GET(2,7,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER3_set(v)       _BGQ_SET(2,7,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER3_insert(x,v)  _BGQ_INSERT(2,7,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER4_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER4_position     9
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER4_get(x)       _BGQ_GET(2,9,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER4_set(v)       _BGQ_SET(2,9,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER4_insert(x,v)  _BGQ_INSERT(2,9,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER5_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER5_position     11
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER5_get(x)       _BGQ_GET(2,11,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER5_set(v)       _BGQ_SET(2,11,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER5_insert(x,v)  _BGQ_INSERT(2,11,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER6_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER6_position     13
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER6_get(x)       _BGQ_GET(2,13,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER6_set(v)       _BGQ_SET(2,13,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER6_insert(x,v)  _BGQ_INSERT(2,13,x,v)


#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER7_width        2
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER7_position     15
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER7_get(x)       _BGQ_GET(2,15,x)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER7_set(v)       _BGQ_SET(2,15,v)
#define MU_DCR__ECC_COUNT_INTERRUPTS_CONTROL_HIGH__ECC_COUNT_OVER7_insert(x,v)  _BGQ_INSERT(2,15,x,v)

#ifndef __ASSEMBLY__

typedef struct mu_dcr { 
    /* 0x0000 */ uint64_t reserve_0000[0x0D00];
    /* 0x0D00 */ uint64_t imfifo_thold_int_en[MU_DCR__IMFIFO_THOLD_INT_EN_range];
    /* 0x0D11 */ uint64_t imfifo_system[MU_DCR__IMFIFO_SYSTEM_range];
    /* 0x0D22 */ uint64_t imfifo_rget[MU_DCR__IMFIFO_RGET_range];
    /* 0x0D33 */ uint64_t imu_thold;
    /* 0x0D34 */ uint64_t rget_thold;
    /* 0x0D35 */ uint64_t rmfifo_en[MU_DCR__RMFIFO_EN_range];
    /* 0x0D46 */ uint64_t rmfifo_thold_int_en[MU_DCR__RMFIFO_THOLD_INT_EN_range];
    /* 0x0D57 */ uint64_t rmfifo_packet_int_en[MU_DCR__RMFIFO_PACKET_INT_EN_range];
    /* 0x0D68 */ uint64_t rmfifo_system[MU_DCR__RMFIFO_SYSTEM_range];
    /* 0x0D79 */ uint64_t rmu_thold;
    /* 0x0D7A */ uint64_t rputbase_system0;
    /* 0x0D7B */ uint64_t rputbase_system1;
    /* 0x0D7C */ uint64_t sys_barrier;
    /* 0x0D7D */ uint64_t barrier_int_en;
    /* 0x0D7E */ uint64_t reserve_0D7E[0x0002];
    /* 0x0D80 */ uint64_t min_usr_addr_range[MU_DCR__MIN_USR_ADDR_RANGE_range];
    /* 0x0D94 */ uint64_t max_usr_addr_range[MU_DCR__MAX_USR_ADDR_RANGE_range];
    /* 0x0DA8 */ uint64_t min_sys_addr_range[MU_DCR__MIN_SYS_ADDR_RANGE_range];
    /* 0x0DB0 */ uint64_t max_sys_addr_range[MU_DCR__MAX_SYS_ADDR_RANGE_range];
    /* 0x0DB8 */ uint64_t usr_inj_range;
    /* 0x0DB9 */ uint64_t sys_inj_range;
    /* 0x0DBA */ uint64_t reserve_0DBA[0x000D];
    /* 0x0DC7 */ uint64_t ime_enable;
    /* 0x0DC8 */ uint64_t rme_enable;
    /* 0x0DC9 */ uint64_t rme_wait_full;
    /* 0x0DCA */ uint64_t rme_wait_tail;
    /* 0x0DCB */ uint64_t gip_int_en_0_7;
    /* 0x0DCC */ uint64_t gip_int_en_8_15;
    /* 0x0DCD */ uint64_t gip_int_en_16;
    /* 0x0DCE */ uint64_t xm_gen_cnt_delay;
    /* 0x0DCF */ uint64_t reset;
    /* 0x0DD0 */ uint64_t mod_halt_en;
    /* 0x0DD1 */ uint64_t mod_halted;
    /* 0x0DD2 */ uint64_t arlog_scan_enable;
    /* 0x0DD3 */ uint64_t rme_hdump;
    /* 0x0DD4 */ uint64_t ecc_pass;
    /* 0x0DD5 */ uint64_t mcsram_bd_ctl;
    /* 0x0DD6 */ uint64_t mcsram_bd_wdata;
    /* 0x0DD7 */ uint64_t reserve_0DD7[0x0006];
    /* 0x0DDD */ uint64_t mcsram_bd_rdata0;
    /* 0x0DDE */ uint64_t mcsram_bd_rdata1;
    /* 0x0DDF */ uint64_t mcsram_bd_rdata2;
    /* 0x0DE0 */ uint64_t mcsram_bd_rdata3;
    /* 0x0DE1 */ uint64_t mcsram_bd_rdata4;
    /* 0x0DE2 */ uint64_t mcsram_bd_rdata5;
    /* 0x0DE3 */ uint64_t mcsram_bd_rdecc;
    /* 0x0DE4 */ uint64_t mcsram_bd_fetching_desc;
    /* 0x0DE5 */ uint64_t rcsram_bd_ctl;
    /* 0x0DE6 */ uint64_t rcsram_bd_rdata;
    /* 0x0DE7 */ uint64_t rput_backdoor;
    /* 0x0DE8 */ uint64_t rput_backdoor_rdecc;
    /* 0x0DE9 */ uint64_t ime_state;
    /* 0x0DEA */ uint64_t rme_state0;
    /* 0x0DEB */ uint64_t rme_state1;
    /* 0x0DEC */ uint64_t inj_ndfifo_avail;
    /* 0x0DED */ uint64_t ecc_int_thresh;
    /* 0x0DEE */ uint64_t arlog_ecc_count;
    /* 0x0DEF */ uint64_t icsram_ecc_count;
    /* 0x0DF0 */ uint64_t mcsram_ecc_count;
    /* 0x0DF1 */ uint64_t rcsram_ecc_count;
    /* 0x0DF2 */ uint64_t rput_ecc_count;
    /* 0x0DF3 */ uint64_t mmregs_ecc_count;
    /* 0x0DF4 */ uint64_t xs_ecc_count;
    /* 0x0DF5 */ uint64_t rme_ecc_count;
    /* 0x0DF6 */ uint64_t spare_dcr;
    /* 0x0DF7 */ uint64_t reserve_0DF7[0x0009];
    /* 0x0E00 */ uint64_t interrupt_internal_error__state;
    /* 0x0E01 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0E02 */ uint64_t interrupt_internal_error__force;
    /* 0x0E03 */ uint64_t interrupt_internal_error__first;
    /* 0x0E04 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0E05 */ uint64_t interrupt_internal_error__critical;
    /* 0x0E06 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0E07 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0E08 */ uint64_t interrupt_internal_error_hw_info;
    /* 0x0E09 */ uint64_t interrupt_internal_error_data_info;
    /* 0x0E0A */ uint64_t master_port0_interrupts__state;
    /* 0x0E0B */ uint64_t master_port0_interrupts_control_low;
    /* 0x0E0C */ uint64_t master_port0_interrupts_control_high;
    /* 0x0E0D */ uint64_t master_port0_interrupts__force;
    /* 0x0E0E */ uint64_t master_port0_interrupts__first;
    /* 0x0E0F */ uint64_t master_port0_interrupts__machine_check;
    /* 0x0E10 */ uint64_t master_port0_interrupts__critical;
    /* 0x0E11 */ uint64_t master_port0_interrupts__noncritical;
    /* 0x0E12 */ uint64_t xm0_err_info;
    /* 0x0E13 */ uint64_t master_port1_interrupts__state;
    /* 0x0E14 */ uint64_t master_port1_interrupts_control_low;
    /* 0x0E15 */ uint64_t master_port1_interrupts_control_high;
    /* 0x0E16 */ uint64_t master_port1_interrupts__force;
    /* 0x0E17 */ uint64_t master_port1_interrupts__first;
    /* 0x0E18 */ uint64_t master_port1_interrupts__machine_check;
    /* 0x0E19 */ uint64_t master_port1_interrupts__critical;
    /* 0x0E1A */ uint64_t master_port1_interrupts__noncritical;
    /* 0x0E1B */ uint64_t xm1_err_info;
    /* 0x0E1C */ uint64_t master_port2_interrupts__state;
    /* 0x0E1D */ uint64_t master_port2_interrupts_control_low;
    /* 0x0E1E */ uint64_t master_port2_interrupts_control_high;
    /* 0x0E1F */ uint64_t master_port2_interrupts__force;
    /* 0x0E20 */ uint64_t master_port2_interrupts__first;
    /* 0x0E21 */ uint64_t master_port2_interrupts__machine_check;
    /* 0x0E22 */ uint64_t master_port2_interrupts__critical;
    /* 0x0E23 */ uint64_t master_port2_interrupts__noncritical;
    /* 0x0E24 */ uint64_t xm2_err_info;
    /* 0x0E25 */ uint64_t slave_port_interrupts__state;
    /* 0x0E26 */ uint64_t slave_port_interrupts_control_low;
    /* 0x0E27 */ uint64_t slave_port_interrupts_control_high;
    /* 0x0E28 */ uint64_t slave_port_interrupts__force;
    /* 0x0E29 */ uint64_t slave_port_interrupts__first;
    /* 0x0E2A */ uint64_t slave_port_interrupts__machine_check;
    /* 0x0E2B */ uint64_t slave_port_interrupts__critical;
    /* 0x0E2C */ uint64_t slave_port_interrupts__noncritical;
    /* 0x0E2D */ uint64_t xs_err_info;
    /* 0x0E2E */ uint64_t mmregs_interrupts__state;
    /* 0x0E2F */ uint64_t mmregs_interrupts_control_low;
    /* 0x0E30 */ uint64_t mmregs_interrupts_control_high;
    /* 0x0E31 */ uint64_t mmregs_interrupts__force;
    /* 0x0E32 */ uint64_t mmregs_interrupts__first;
    /* 0x0E33 */ uint64_t mmregs_interrupts__machine_check;
    /* 0x0E34 */ uint64_t mmregs_interrupts__critical;
    /* 0x0E35 */ uint64_t mmregs_interrupts__noncritical;
    /* 0x0E36 */ uint64_t mmregs_fifo_prot_err;
    /* 0x0E37 */ uint64_t fifo_interrupts__state;
    /* 0x0E38 */ uint64_t fifo_interrupts_control_low;
    /* 0x0E39 */ uint64_t fifo_interrupts_control_high;
    /* 0x0E3A */ uint64_t fifo_interrupts__force;
    /* 0x0E3B */ uint64_t fifo_interrupts__first;
    /* 0x0E3C */ uint64_t fifo_interrupts__machine_check;
    /* 0x0E3D */ uint64_t fifo_interrupts__critical;
    /* 0x0E3E */ uint64_t fifo_interrupts__noncritical;
    /* 0x0E3F */ uint64_t rmfifo;
    /* 0x0E40 */ uint64_t imu_ecc_interrupts__state;
    /* 0x0E41 */ uint64_t imu_ecc_interrupts_control_low;
    /* 0x0E42 */ uint64_t imu_ecc_interrupts_control_high;
    /* 0x0E43 */ uint64_t imu_ecc_interrupts__force;
    /* 0x0E44 */ uint64_t imu_ecc_interrupts__first;
    /* 0x0E45 */ uint64_t imu_ecc_interrupts__machine_check;
    /* 0x0E46 */ uint64_t imu_ecc_interrupts__critical;
    /* 0x0E47 */ uint64_t imu_ecc_interrupts__noncritical;
    /* 0x0E48 */ uint64_t mcsram_interrupts__state;
    /* 0x0E49 */ uint64_t mcsram_interrupts_control_low;
    /* 0x0E4A */ uint64_t mcsram_interrupts_control_high;
    /* 0x0E4B */ uint64_t mcsram_interrupts__force;
    /* 0x0E4C */ uint64_t mcsram_interrupts__first;
    /* 0x0E4D */ uint64_t mcsram_interrupts__machine_check;
    /* 0x0E4E */ uint64_t mcsram_interrupts__critical;
    /* 0x0E4F */ uint64_t mcsram_interrupts__noncritical;
    /* 0x0E50 */ uint64_t mcsram_err_fifo_id;
    /* 0x0E51 */ uint64_t imfifo;
    /* 0x0E52 */ uint64_t arlog_interrupts__state;
    /* 0x0E53 */ uint64_t arlog_interrupts_control_low;
    /* 0x0E54 */ uint64_t arlog_interrupts_control_high;
    /* 0x0E55 */ uint64_t arlog_interrupts__force;
    /* 0x0E56 */ uint64_t arlog_interrupts__first;
    /* 0x0E57 */ uint64_t arlog_interrupts__machine_check;
    /* 0x0E58 */ uint64_t arlog_interrupts__critical;
    /* 0x0E59 */ uint64_t arlog_interrupts__noncritical;
    /* 0x0E5A */ uint64_t rmu_ecc_interrupts__state;
    /* 0x0E5B */ uint64_t rmu_ecc_interrupts_control_low;
    /* 0x0E5C */ uint64_t rmu_ecc_interrupts_control_high;
    /* 0x0E5D */ uint64_t rmu_ecc_interrupts__force;
    /* 0x0E5E */ uint64_t rmu_ecc_interrupts__first;
    /* 0x0E5F */ uint64_t rmu_ecc_interrupts__machine_check;
    /* 0x0E60 */ uint64_t rmu_ecc_interrupts__critical;
    /* 0x0E61 */ uint64_t rmu_ecc_interrupts__noncritical;
    /* 0x0E62 */ uint64_t rcsram_interrupts__state;
    /* 0x0E63 */ uint64_t rcsram_interrupts_control_low;
    /* 0x0E64 */ uint64_t rcsram_interrupts_control_high;
    /* 0x0E65 */ uint64_t rcsram_interrupts__force;
    /* 0x0E66 */ uint64_t rcsram_interrupts__first;
    /* 0x0E67 */ uint64_t rcsram_interrupts__machine_check;
    /* 0x0E68 */ uint64_t rcsram_interrupts__critical;
    /* 0x0E69 */ uint64_t rcsram_interrupts__noncritical;
    /* 0x0E6A */ uint64_t rmfifo_access_error_id;
    /* 0x0E6B */ uint64_t rputsram_interrupts__state;
    /* 0x0E6C */ uint64_t rputsram_interrupts_control_low;
    /* 0x0E6D */ uint64_t rputsram_interrupts_control_high;
    /* 0x0E6E */ uint64_t rputsram_interrupts__force;
    /* 0x0E6F */ uint64_t rputsram_interrupts__first;
    /* 0x0E70 */ uint64_t rputsram_interrupts__machine_check;
    /* 0x0E71 */ uint64_t rputsram_interrupts__critical;
    /* 0x0E72 */ uint64_t rputsram_interrupts__noncritical;
    /* 0x0E73 */ uint64_t ime_interrupts__state;
    /* 0x0E74 */ uint64_t ime_interrupts_control_low;
    /* 0x0E75 */ uint64_t ime_interrupts_control_high;
    /* 0x0E76 */ uint64_t ime_interrupts__force;
    /* 0x0E77 */ uint64_t ime_interrupts__first;
    /* 0x0E78 */ uint64_t ime_interrupts__machine_check;
    /* 0x0E79 */ uint64_t ime_interrupts__critical;
    /* 0x0E7A */ uint64_t ime_interrupts__noncritical;
    /* 0x0E7B */ uint64_t ime_p_err0;
    /* 0x0E7C */ uint64_t ime_p_err1;
    /* 0x0E7D */ uint64_t ime_p_err2;
    /* 0x0E7E */ uint64_t ime_p_err3;
    /* 0x0E7F */ uint64_t ime_p_err4;
    /* 0x0E80 */ uint64_t ime_p_err5;
    /* 0x0E81 */ uint64_t ime_p_err6;
    /* 0x0E82 */ uint64_t ime_p_err7;
    /* 0x0E83 */ uint64_t ime_p_err8;
    /* 0x0E84 */ uint64_t ime_p_err9;
    /* 0x0E85 */ uint64_t ime_p_err10;
    /* 0x0E86 */ uint64_t ime_p_err11;
    /* 0x0E87 */ uint64_t ime_p_err12;
    /* 0x0E88 */ uint64_t ime_p_err13;
    /* 0x0E89 */ uint64_t ime_p_err14;
    /* 0x0E8A */ uint64_t ime_p_err15;
    /* 0x0E8B */ uint64_t rme_interrupts0__state;
    /* 0x0E8C */ uint64_t rme_interrupts0_control_low;
    /* 0x0E8D */ uint64_t rme_interrupts0_control_high;
    /* 0x0E8E */ uint64_t rme_interrupts0__force;
    /* 0x0E8F */ uint64_t rme_interrupts0__first;
    /* 0x0E90 */ uint64_t rme_interrupts0__machine_check;
    /* 0x0E91 */ uint64_t rme_interrupts0__critical;
    /* 0x0E92 */ uint64_t rme_interrupts0__noncritical;
    /* 0x0E93 */ uint64_t rme_interrupts1__state;
    /* 0x0E94 */ uint64_t rme_interrupts1_control_low;
    /* 0x0E95 */ uint64_t rme_interrupts1_control_high;
    /* 0x0E96 */ uint64_t rme_interrupts1__force;
    /* 0x0E97 */ uint64_t rme_interrupts1__first;
    /* 0x0E98 */ uint64_t rme_interrupts1__machine_check;
    /* 0x0E99 */ uint64_t rme_interrupts1__critical;
    /* 0x0E9A */ uint64_t rme_interrupts1__noncritical;
    /* 0x0E9B */ uint64_t rme_p_err0;
    /* 0x0E9C */ uint64_t rme_header_err0;
    /* 0x0E9D */ uint64_t rme_p_err1;
    /* 0x0E9E */ uint64_t rme_header_err1;
    /* 0x0E9F */ uint64_t rme_p_err2;
    /* 0x0EA0 */ uint64_t rme_header_err2;
    /* 0x0EA1 */ uint64_t rme_p_err3;
    /* 0x0EA2 */ uint64_t rme_header_err3;
    /* 0x0EA3 */ uint64_t rme_p_err4;
    /* 0x0EA4 */ uint64_t rme_header_err4;
    /* 0x0EA5 */ uint64_t rme_p_err5;
    /* 0x0EA6 */ uint64_t rme_header_err5;
    /* 0x0EA7 */ uint64_t rme_p_err6;
    /* 0x0EA8 */ uint64_t rme_header_err6;
    /* 0x0EA9 */ uint64_t rme_p_err7;
    /* 0x0EAA */ uint64_t rme_header_err7;
    /* 0x0EAB */ uint64_t rme_p_err8;
    /* 0x0EAC */ uint64_t rme_header_err8;
    /* 0x0EAD */ uint64_t rme_p_err9;
    /* 0x0EAE */ uint64_t rme_header_err9;
    /* 0x0EAF */ uint64_t rme_p_err10;
    /* 0x0EB0 */ uint64_t rme_header_err10;
    /* 0x0EB1 */ uint64_t rme_p_err11;
    /* 0x0EB2 */ uint64_t rme_header_err11;
    /* 0x0EB3 */ uint64_t rme_p_err12;
    /* 0x0EB4 */ uint64_t rme_header_err12;
    /* 0x0EB5 */ uint64_t rme_p_err13;
    /* 0x0EB6 */ uint64_t rme_header_err13;
    /* 0x0EB7 */ uint64_t rme_p_err14;
    /* 0x0EB8 */ uint64_t rme_header_err14;
    /* 0x0EB9 */ uint64_t rme_p_err15;
    /* 0x0EBA */ uint64_t rme_header_err15;
    /* 0x0EBB */ uint64_t icsram_interrupts__state;
    /* 0x0EBC */ uint64_t icsram_interrupts_control_low;
    /* 0x0EBD */ uint64_t icsram_interrupts_control_high;
    /* 0x0EBE */ uint64_t icsram_interrupts__force;
    /* 0x0EBF */ uint64_t icsram_interrupts__first;
    /* 0x0EC0 */ uint64_t icsram_interrupts__machine_check;
    /* 0x0EC1 */ uint64_t icsram_interrupts__critical;
    /* 0x0EC2 */ uint64_t icsram_interrupts__noncritical;
    /* 0x0EC3 */ uint64_t icsram_rget_fifo_full;
    /* 0x0EC4 */ uint64_t misc_interrupts__state;
    /* 0x0EC5 */ uint64_t misc_interrupts_control_low;
    /* 0x0EC6 */ uint64_t misc_interrupts_control_high;
    /* 0x0EC7 */ uint64_t misc_interrupts__force;
    /* 0x0EC8 */ uint64_t misc_interrupts__first;
    /* 0x0EC9 */ uint64_t misc_interrupts__machine_check;
    /* 0x0ECA */ uint64_t misc_interrupts__critical;
    /* 0x0ECB */ uint64_t misc_interrupts__noncritical;
    /* 0x0ECC */ uint64_t imfifo_access_error_id;
    /* 0x0ECD */ uint64_t rmu_ecc_corr_interrupts__state;
    /* 0x0ECE */ uint64_t rmu_ecc_corr_interrupts_control_low;
    /* 0x0ECF */ uint64_t rmu_ecc_corr_interrupts_control_high;
    /* 0x0ED0 */ uint64_t rmu_ecc_corr_interrupts__force;
    /* 0x0ED1 */ uint64_t rmu_ecc_corr_interrupts__first;
    /* 0x0ED2 */ uint64_t rmu_ecc_corr_interrupts__machine_check;
    /* 0x0ED3 */ uint64_t rmu_ecc_corr_interrupts__critical;
    /* 0x0ED4 */ uint64_t rmu_ecc_corr_interrupts__noncritical;
    /* 0x0ED5 */ uint64_t misc_ecc_corr_interrupts__state;
    /* 0x0ED6 */ uint64_t misc_ecc_corr_interrupts_control_low;
    /* 0x0ED7 */ uint64_t misc_ecc_corr_interrupts_control_high;
    /* 0x0ED8 */ uint64_t misc_ecc_corr_interrupts__force;
    /* 0x0ED9 */ uint64_t misc_ecc_corr_interrupts__first;
    /* 0x0EDA */ uint64_t misc_ecc_corr_interrupts__machine_check;
    /* 0x0EDB */ uint64_t misc_ecc_corr_interrupts__critical;
    /* 0x0EDC */ uint64_t misc_ecc_corr_interrupts__noncritical;
    /* 0x0EDD */ uint64_t ecc_count_interrupts__state;
    /* 0x0EDE */ uint64_t ecc_count_interrupts_control_low;
    /* 0x0EDF */ uint64_t ecc_count_interrupts_control_high;
    /* 0x0EE0 */ uint64_t ecc_count_interrupts__force;
    /* 0x0EE1 */ uint64_t ecc_count_interrupts__first;
    /* 0x0EE2 */ uint64_t ecc_count_interrupts__machine_check;
    /* 0x0EE3 */ uint64_t ecc_count_interrupts__critical;
    /* 0x0EE4 */ uint64_t ecc_count_interrupts__noncritical;
    /* 0x0EE5 */ uint64_t reserve_0EE5[0x001B];
    /* 0x0F00 */ uint64_t upc_mu_counter[MU_DCR__UPC_MU_COUNTER_range];
    /* 0x0F28 */ uint64_t reserve_0F28[0x0019];
    /* 0x0F41 */ uint64_t upc_mu_counter_control_rw;
    /* 0x0F42 */ uint64_t upc_mu_counter_control_w1s;
    /* 0x0F43 */ uint64_t upc_mu_counter_control_w1c;
    /* 0x0F44 */ uint64_t upc_mu_config;
} mu_dcr_t;
  
#define MU_DCR_USER_PTR _DCR_USER_PTR(mu_dcr_t, MU_DCR)
#define MU_DCR_PRIV_PTR _DCR_PRIV_PTR(mu_dcr_t, MU_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
