/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _ND_500_DCR__H_ // Prevent multiple inclusion
#define   _ND_500_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define ND_500_DCR_base    (0x194000)  // Base address for all instances
#define ND_500_DCR_size    (0x0099)    // Size of instance (largest offset + 1 )
  
#define ND_500_DCR(reg) _DCR_REG(ND_500_DCR, reg)
  
// Register:

#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW_offset         (0x0081) // Offset of Control register in instance

#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW__LOCAL_RING_width        2
#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW__LOCAL_RING_position     63
#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW__LOCAL_RING_get(x)       _BGQ_GET(2,63,x)
#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW__LOCAL_RING_set(v)       _BGQ_SET(2,63,v)
#define ND_500_DCR__N500_INTERRUPTS_CONTROL_LOW__LOCAL_RING_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: n500_interrupts_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_500_DCR__N500_INTERRUPTS_CONTROL_HIGH_offset         (0x0082) // Offset of Control register in instance
  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0091) // Offset of Control register in instance

#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define ND_500_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct nd_500_dcr { 
    /* 0x0000 */ uint64_t reset;
    /* 0x0001 */ uint64_t ctrl_stop;
    /* 0x0002 */ uint64_t ctrl_internal;
    /* 0x0003 */ uint64_t ctrl_clear0;
    /* 0x0004 */ uint64_t ctrl_coords;
    /* 0x0005 */ uint64_t ctrl_cutoffs;
    /* 0x0006 */ uint64_t ctrl_neighbor_coords;
    /* 0x0007 */ uint64_t ctrl_det_order;
    /* 0x0008 */ uint64_t ctrl_dynamic_zone01;
    /* 0x0009 */ uint64_t ctrl_dynamic_zone23;
    /* 0x000A */ uint64_t ctrl_timeout;
    /* 0x000B */ uint64_t ctrl_gi_class_00_01;
    /* 0x000C */ uint64_t ctrl_gi_class_02_03;
    /* 0x000D */ uint64_t ctrl_gi_class_04_05;
    /* 0x000E */ uint64_t ctrl_gi_class_06_07;
    /* 0x000F */ uint64_t ctrl_gi_class_08_09;
    /* 0x0010 */ uint64_t ctrl_gi_class_10_11;
    /* 0x0011 */ uint64_t ctrl_gi_class_12_13;
    /* 0x0012 */ uint64_t ctrl_gi_class_14_15;
    /* 0x0013 */ uint64_t ctrl_coll_class_00_01;
    /* 0x0014 */ uint64_t ctrl_coll_class_02_03;
    /* 0x0015 */ uint64_t ctrl_coll_class_04_05;
    /* 0x0016 */ uint64_t ctrl_coll_class_06_07;
    /* 0x0017 */ uint64_t ctrl_coll_class_08_09;
    /* 0x0018 */ uint64_t ctrl_coll_class_10_11;
    /* 0x0019 */ uint64_t ctrl_coll_class_12_13;
    /* 0x001A */ uint64_t ctrl_coll_class_14_15;
    /* 0x001B */ uint64_t fatal_err_enable[ND_500_DCR__FATAL_ERR_ENABLE_range];
    /* 0x0021 */ uint64_t non_fatal_err_enable[ND_500_DCR__NON_FATAL_ERR_ENABLE_range];
    /* 0x0023 */ uint64_t fatal_err0;
    /* 0x0024 */ uint64_t fatal_err1;
    /* 0x0025 */ uint64_t fatal_err2;
    /* 0x0026 */ uint64_t fatal_err3;
    /* 0x0027 */ uint64_t fatal_err4;
    /* 0x0028 */ uint64_t fatal_err5;
    /* 0x0029 */ uint64_t non_fatal_err0;
    /* 0x002A */ uint64_t non_fatal_err1;
    /* 0x002B */ uint64_t backdoor_ctrl;
    /* 0x002C */ uint64_t backdoor_wr;
    /* 0x002D */ uint64_t reserve_002D;
    /* 0x002E */ uint64_t backdoor_rd_data[ND_500_DCR__BACKDOOR_RD_DATA_range];
    /* 0x0030 */ uint64_t backdoor_rd_ecc;
    /* 0x0031 */ uint64_t stat0;
    /* 0x0032 */ uint64_t stat1;
    /* 0x0033 */ uint64_t stat2;
    /* 0x0034 */ uint64_t stat3;
    /* 0x0035 */ uint64_t stat4;
    /* 0x0036 */ uint64_t stat5;
    /* 0x0037 */ uint64_t stat6;
    /* 0x0038 */ uint64_t stat7;
    /* 0x0039 */ uint64_t stat8;
    /* 0x003A */ uint64_t stat9;
    /* 0x003B */ uint64_t gi_stat_re[ND_500_DCR__GI_STAT_RE_range];
    /* 0x0046 */ uint64_t ce_cnt[ND_500_DCR__CE_CNT_range];
    /* 0x004F */ uint64_t ce_threshold;
    /* 0x0050 */ uint64_t ctrl_clear1;
    /* 0x0051 */ uint64_t ctrl_reserved;
    /* 0x0052 */ uint64_t ctrl_upc_clear;
    /* 0x0053 */ uint64_t ctrl_upc_stop;
    /* 0x0054 */ uint64_t fatal_err_stat;
    /* 0x0055 */ uint64_t non_fatal_err_stat;
    /* 0x0056 */ uint64_t reserve_0056[0x000A];
    /* 0x0060 */ uint64_t inj_fifo_chksum[ND_500_DCR__INJ_FIFO_CHKSUM_range];
    /* 0x0070 */ uint64_t inj_fifo_head_p0;
    /* 0x0071 */ uint64_t inj_fifo_head_p1;
    /* 0x0072 */ uint64_t inj_fifo_tail_p0;
    /* 0x0073 */ uint64_t inj_fifo_tail_p1;
    /* 0x0074 */ uint64_t rcp_fifo_head_p0;
    /* 0x0075 */ uint64_t rcp_fifo_head_p1;
    /* 0x0076 */ uint64_t rcp_fifo_head_p2;
    /* 0x0077 */ uint64_t rcp_fifo_head_p3;
    /* 0x0078 */ uint64_t rcp_fifo_tail_p0;
    /* 0x0079 */ uint64_t rcp_fifo_tail_p1;
    /* 0x007A */ uint64_t rcp_fifo_tail_p2;
    /* 0x007B */ uint64_t rcp_fifo_tail_p3;
    /* 0x007C */ uint64_t reserve_007C[0x0004];
    /* 0x0080 */ uint64_t n500_interrupts__state;
    /* 0x0081 */ uint64_t n500_interrupts_control_low;
    /* 0x0082 */ uint64_t n500_interrupts_control_high;
    /* 0x0083 */ uint64_t n500_interrupts__force;
    /* 0x0084 */ uint64_t n500_interrupts__first;
    /* 0x0085 */ uint64_t n500_interrupts__machine_check;
    /* 0x0086 */ uint64_t n500_interrupts__critical;
    /* 0x0087 */ uint64_t n500_interrupts__noncritical;
    /* 0x0088 */ uint64_t reserve_0088[0x0008];
    /* 0x0090 */ uint64_t interrupt_internal_error__state;
    /* 0x0091 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0092 */ uint64_t interrupt_internal_error__force;
    /* 0x0093 */ uint64_t interrupt_internal_error__first;
    /* 0x0094 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0095 */ uint64_t interrupt_internal_error__critical;
    /* 0x0096 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0097 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0098 */ uint64_t interrupt_internal_error_hw_info;
} nd_500_dcr_t;
  
#define ND_500_DCR_USER_PTR _DCR_USER_PTR(nd_500_dcr_t, ND_500_DCR)
#define ND_500_DCR_PRIV_PTR _DCR_PRIV_PTR(nd_500_dcr_t, ND_500_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
