/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _ND_RESE_DCR__H_ // Prevent multiple inclusion
#define   _ND_RESE_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define ND_RESE_DCR_base    (0x168000)  // Base address for all instances
#define ND_RESE_DCR_size    (0x0059)    // Size of instance (largest offset + 1 )
#define ND_RESE_DCR_stride  (0x4000)    // Distance between instances

#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW_offset         (0x0041) // Offset of Control register in instance

#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW__LOCAL_RING_width        2
#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW__LOCAL_RING_position     63
#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW__LOCAL_RING_get(x)       _BGQ_GET(2,63,x)
#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW__LOCAL_RING_set(v)       _BGQ_SET(2,63,v)
#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_LOW__LOCAL_RING_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: rese_interrupts_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_RESE_DCR__RESE_INTERRUPTS_CONTROL_HIGH_offset         (0x0042) // Offset of Control register in instance
  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0051) // Offset of Control register in instance

#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define ND_RESE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct nd_rese_dcr { 
    /* 0x0000 */ uint64_t reset;
    /* 0x0001 */ uint64_t ctrl;
    /* 0x0002 */ uint64_t upc_ctrl;
    /* 0x0003 */ uint64_t thresh_array_ce;
    /* 0x0004 */ uint64_t thresh_re_err;
    /* 0x0005 */ uint64_t thresh_se_retran;
    /* 0x0006 */ uint64_t clear;
    /* 0x0007 */ uint64_t fatal_err;
    /* 0x0008 */ uint64_t fatal_err_enable;
    /* 0x0009 */ uint64_t re_link_err_cnt;
    /* 0x000A */ uint64_t se_retrans_cnt;
    /* 0x000B */ uint64_t ce_count[ND_RESE_DCR__CE_COUNT_range];
    /* 0x0014 */ uint64_t upc[ND_RESE_DCR__UPC_range];
    /* 0x001A */ uint64_t reserve_001A[0x0006];
    /* 0x0020 */ uint64_t backdoor_ctl;
    /* 0x0021 */ uint64_t coll_class_remap_vec;
    /* 0x0022 */ uint64_t backdoor_wr_data;
    /* 0x0023 */ uint64_t backdoor_wr_ecc;
    /* 0x0024 */ uint64_t backdoor_rd_data;
    /* 0x0025 */ uint64_t backdoor_rd;
    /* 0x0026 */ uint64_t se_gi_data;
    /* 0x0027 */ uint64_t re_link_crc_usr;
    /* 0x0028 */ uint64_t re_link_crc_sys;
    /* 0x0029 */ uint64_t se_link_crc_usr;
    /* 0x002A */ uint64_t se_link_crc_sys;
    /* 0x002B */ uint64_t reserve_002B[0x0005];
    /* 0x0030 */ uint64_t re_internal_state;
    /* 0x0031 */ uint64_t re_vc0_head;
    /* 0x0032 */ uint64_t re_vc0_tail;
    /* 0x0033 */ uint64_t re_vc0_pkt_cnt;
    /* 0x0034 */ uint64_t re_vc0_state;
    /* 0x0035 */ uint64_t re_vc1_state;
    /* 0x0036 */ uint64_t re_vc2_state;
    /* 0x0037 */ uint64_t re_vc3_state;
    /* 0x0038 */ uint64_t re_vc4_state;
    /* 0x0039 */ uint64_t re_vc5_state;
    /* 0x003A */ uint64_t se_internal_state;
    /* 0x003B */ uint64_t se_tokens;
    /* 0x003C */ uint64_t reserve_003C[0x0004];
    /* 0x0040 */ uint64_t rese_interrupts__state;
    /* 0x0041 */ uint64_t rese_interrupts_control_low;
    /* 0x0042 */ uint64_t rese_interrupts_control_high;
    /* 0x0043 */ uint64_t rese_interrupts__force;
    /* 0x0044 */ uint64_t rese_interrupts__first;
    /* 0x0045 */ uint64_t rese_interrupts__machine_check;
    /* 0x0046 */ uint64_t rese_interrupts__critical;
    /* 0x0047 */ uint64_t rese_interrupts__noncritical;
    /* 0x0048 */ uint64_t reserve_0048[0x0008];
    /* 0x0050 */ uint64_t interrupt_internal_error__state;
    /* 0x0051 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0052 */ uint64_t interrupt_internal_error__force;
    /* 0x0053 */ uint64_t interrupt_internal_error__first;
    /* 0x0054 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0055 */ uint64_t interrupt_internal_error__critical;
    /* 0x0056 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0057 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0058 */ uint64_t interrupt_internal_error_hw_info;
} nd_rese_dcr_t;
  
#define ND_RESE_DCR_USER_PTR(i) _DCR_USER_PTR__INDEX(nd_rese_dcr_t, ND_RESE_DCR, i)
#define ND_RESE_DCR_PRIV_PTR(i) _DCR_PRIV_PTR__INDEX(nd_rese_dcr_t, ND_RESE_DCR, i)
  
#define ND_RESE_DCR_USER_PTR__T0 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T0)
#define ND_RESE_DCR_USER_PTR__T1 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T1)
#define ND_RESE_DCR_USER_PTR__T2 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T2)
#define ND_RESE_DCR_USER_PTR__T3 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T3)
#define ND_RESE_DCR_USER_PTR__T4 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T4)
#define ND_RESE_DCR_USER_PTR__T5 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T5)
#define ND_RESE_DCR_USER_PTR__T6 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T6)
#define ND_RESE_DCR_USER_PTR__T7 _DCR_USER_PTR__NAME(nd_rese_dcr_t, ND_RESE_DCR, T7)
