/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _ND_X2_DCR__H_ // Prevent multiple inclusion
#define   _ND_X2_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define ND_X2_DCR_base    (0x198000)  // Base address for all instances
#define ND_X2_DCR_size    (0x0039)    // Size of instance (largest offset + 1 )
  
#define ND_X2_DCR(reg) _DCR_REG(ND_X2_DCR, reg)
  
// Register:
//   Name:        reset

//   Permission: Read: All; Write: Privileged and TestInt
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW_offset         (0x0021) // Offset of Control register in instance

#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW__LOCAL_RING_width        2
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW__LOCAL_RING_position     63
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW__LOCAL_RING_get(x)       _BGQ_GET(2,63,x)
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW__LOCAL_RING_set(v)       _BGQ_SET(2,63,v)
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_LOW__LOCAL_RING_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: x2_interrupts_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_X2_DCR__X2_INTERRUPTS_CONTROL_HIGH_offset         (0x0022) // Offset of Control register in instance
  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0031) // Offset of Control register in instance

#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define ND_X2_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct nd_x2_dcr { 
    /* 0x0000 */ uint64_t reset;
    /* 0x0001 */ uint64_t ctrl;
    /* 0x0002 */ uint64_t fatal_err0_enable;
    /* 0x0003 */ uint64_t fatal_err0;
    /* 0x0004 */ uint64_t fatal_err1_enable;
    /* 0x0005 */ uint64_t fatal_err1;
    /* 0x0006 */ uint64_t backdoor_ctrl;
    /* 0x0007 */ uint64_t backdoor_wr_data[ND_X2_DCR__BACKDOOR_WR_DATA_range];
    /* 0x0009 */ uint64_t backdoor_wr_ecc;
    /* 0x000A */ uint64_t backdoor_rd;
    /* 0x000B */ uint64_t stat0;
    /* 0x000C */ uint64_t stat1;
    /* 0x000D */ uint64_t reserve_000D[0x0013];
    /* 0x0020 */ uint64_t x2_interrupts__state;
    /* 0x0021 */ uint64_t x2_interrupts_control_low;
    /* 0x0022 */ uint64_t x2_interrupts_control_high;
    /* 0x0023 */ uint64_t x2_interrupts__force;
    /* 0x0024 */ uint64_t x2_interrupts__first;
    /* 0x0025 */ uint64_t x2_interrupts__machine_check;
    /* 0x0026 */ uint64_t x2_interrupts__critical;
    /* 0x0027 */ uint64_t x2_interrupts__noncritical;
    /* 0x0028 */ uint64_t reserve_0028[0x0008];
    /* 0x0030 */ uint64_t interrupt_internal_error__state;
    /* 0x0031 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0032 */ uint64_t interrupt_internal_error__force;
    /* 0x0033 */ uint64_t interrupt_internal_error__first;
    /* 0x0034 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0035 */ uint64_t interrupt_internal_error__critical;
    /* 0x0036 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0037 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0038 */ uint64_t interrupt_internal_error_hw_info;
} nd_x2_dcr_t;
  
#define ND_X2_DCR_USER_PTR _DCR_USER_PTR(nd_x2_dcr_t, ND_X2_DCR)
#define ND_X2_DCR_PRIV_PTR _DCR_PRIV_PTR(nd_x2_dcr_t, ND_X2_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
