/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _PE_DCR__H_ // Prevent multiple inclusion
#define   _PE_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define PE_DCR_base    (0x0D0000)  // Base address for all instances
#define PE_DCR_size    (0x0200)    // Size of instance (largest offset + 1 )
  
#define PE_DCR(reg) _DCR_REG(PE_DCR, reg)
  
// Register:
//   Name:        pcie_utl

#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__AL_SINT_width        2
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__AL_SINT_position     61
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__AL_SINT_get(x)       _BGQ_GET(2,61,x)
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__AL_SINT_set(v)       _BGQ_SET(2,61,v)
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__AL_SINT_insert(x,v)  _BGQ_INSERT(2,61,x,v)


#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__UTL_SM_PTY_width        2
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__UTL_SM_PTY_position     63
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__UTL_SM_PTY_get(x)       _BGQ_GET(2,63,x)
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__UTL_SM_PTY_set(v)       _BGQ_SET(2,63,v)
#define PE_DCR__PCIE_INTERRUPT_STATE_CONTROL_HIGH__UTL_SM_PTY_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0033) // Offset of Control register in instance

#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define PE_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct pe_dcr { 
    /* 0x0000 */ uint64_t pcie_config;
    /* 0x0001 */ uint64_t pcie_sourceid;
    /* 0x0002 */ uint64_t pcie_dl_config;
    /* 0x0003 */ uint64_t pcie_dl_status;
    /* 0x0004 */ uint64_t pcie_cfg00;
    /* 0x0005 */ uint64_t pcie_cfg08;
    /* 0x0006 */ uint64_t pcie_ec00;
    /* 0x0007 */ uint64_t pcie_ec04;
    /* 0x0008 */ uint64_t pcie_ec08;
    /* 0x0009 */ uint64_t pcie_ec0c;
    /* 0x000A */ uint64_t pcie_ec14;
    /* 0x000B */ uint64_t pcie_ec18;
    /* 0x000C */ uint64_t pcie_ec18_stat;
    /* 0x000D */ uint64_t pcie_ec24;
    /* 0x000E */ uint64_t pcie_aer_config;
    /* 0x000F */ uint64_t pcie_ifc_cfg;
    /* 0x0010 */ uint64_t reserve_0010;
    /* 0x0011 */ uint64_t pcie_ei_control;
    /* 0x0012 */ uint64_t pcie_ei_status;
    /* 0x0013 */ uint64_t pcie_reset;
    /* 0x0014 */ uint64_t pcie_interrupt_state__state;
    /* 0x0015 */ uint64_t pcie_interrupt_state_control_low;
    /* 0x0016 */ uint64_t pcie_interrupt_state_control_high;
    /* 0x0017 */ uint64_t pcie_interrupt_state__force;
    /* 0x0018 */ uint64_t pcie_interrupt_state__first;
    /* 0x0019 */ uint64_t pcie_interrupt_state__machine_check;
    /* 0x001A */ uint64_t pcie_interrupt_state__critical;
    /* 0x001B */ uint64_t pcie_interrupt_state__noncritical;
    /* 0x001C */ uint64_t reserve_001C[0x0002];
    /* 0x001E */ uint64_t utl_pclk_internal_error_info;
    /* 0x001F */ uint64_t utl_bclk_internal_error_info;
    /* 0x0020 */ uint64_t tldlp_pclk_internal_error_info;
    /* 0x0021 */ uint64_t reserve_0021[0x0011];
    /* 0x0032 */ uint64_t interrupt_internal_error__state;
    /* 0x0033 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0034 */ uint64_t interrupt_internal_error__force;
    /* 0x0035 */ uint64_t interrupt_internal_error__first;
    /* 0x0036 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0037 */ uint64_t interrupt_internal_error__critical;
    /* 0x0038 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0039 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x003A */ uint64_t interrupt_internal_error_hw_info;
    /* 0x003B */ uint64_t interrupt_internal_error_data_info;
    /* 0x003C */ uint64_t reserve_003C[0x0004];
    /* 0x0040 */ uint64_t upc_pcie_counter[PE_DCR__UPC_PCIE_COUNTER_range];
    /* 0x004C */ uint64_t reserve_004C[0x0004];
    /* 0x0050 */ uint64_t upc_pcie_counter_control_rw;
    /* 0x0051 */ uint64_t upc_pcie_counter_control_w1s;
    /* 0x0052 */ uint64_t upc_pcie_counter_control_w1c;
    /* 0x0053 */ uint64_t upc_pcie_config;
    /* 0x0054 */ uint64_t reserve_0054[0x00AC];
    /* 0x0100 */ uint64_t pcie_utl[PE_DCR__PCIE_UTL_range];
} pe_dcr_t;
  
#define PE_DCR_USER_PTR _DCR_USER_PTR(pe_dcr_t, PE_DCR)
#define PE_DCR_PRIV_PTR _DCR_PRIV_PTR(pe_dcr_t, PE_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
