/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _TESTINT_DCR__H_ // Prevent multiple inclusion
#define   _TESTINT_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define TESTINT_DCR_base    (0x0C8000)  // Base address for all instances
#define TESTINT_DCR_size    (0x2002)    // Size of instance (largest offset + 1 )
  
#define TESTINT_DCR(reg) _DCR_REG(TESTINT_DCR, reg)
  
// Register:

#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_EQ_get(x)       _BGQ_GET(2,61,x)
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_EQ_set(v)       _BGQ_SET(2,61,v)
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_EQ_insert(x,v)  _BGQ_INSERT(2,61,x,v)


#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_NE_width        2
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_NE_position     63
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_NE_get(x)       _BGQ_GET(2,63,x)
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_NE_set(v)       _BGQ_SET(2,63,v)
#define TESTINT_DCR__TI_INTERRUPT_STATE_CONTROL_HIGH__INT_MBOX_23_NE_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Privileged Only
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0021) // Offset of Control register in instance

#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define TESTINT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct testint_dcr { 
    /* 0x0000 */ uint64_t jtag_idcode;
    /* 0x0001 */ uint64_t reserve_0001[0x000F];
    /* 0x0010 */ uint64_t ti_interrupt_state__state;
    /* 0x0011 */ uint64_t ti_interrupt_state_control_low;
    /* 0x0012 */ uint64_t ti_interrupt_state_control_high;
    /* 0x0013 */ uint64_t ti_interrupt_state__force;
    /* 0x0014 */ uint64_t ti_interrupt_state__first;
    /* 0x0015 */ uint64_t ti_interrupt_state__machine_check;
    /* 0x0016 */ uint64_t ti_interrupt_state__critical;
    /* 0x0017 */ uint64_t ti_interrupt_state__noncritical;
    /* 0x0018 */ uint64_t reserve_0018[0x0008];
    /* 0x0020 */ uint64_t interrupt_internal_error__state;
    /* 0x0021 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0022 */ uint64_t interrupt_internal_error__force;
    /* 0x0023 */ uint64_t interrupt_internal_error__first;
    /* 0x0024 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0025 */ uint64_t interrupt_internal_error__critical;
    /* 0x0026 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0027 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0028 */ uint64_t interrupt_internal_error_hw_info;
    /* 0x0029 */ uint64_t interrupt_internal_error_data_info;
    /* 0x002A */ uint64_t reserve_002A[0x0006];
    /* 0x0030 */ uint64_t clocks[TESTINT_DCR__CLOCKS_range];
    /* 0x0034 */ uint64_t reserve_0034[0x000C];
    /* 0x0040 */ uint64_t config0[TESTINT_DCR__CONFIG0_range];
    /* 0x0044 */ uint64_t config1[TESTINT_DCR__CONFIG1_range];
    /* 0x0048 */ uint64_t Config0a;
    /* 0x0049 */ uint64_t Config1a;
    /* 0x004A */ uint64_t reserve_004A[0x0006];
    /* 0x0050 */ uint64_t thread_active0[TESTINT_DCR__THREAD_ACTIVE0_range];
    /* 0x0054 */ uint64_t thread_active1[TESTINT_DCR__THREAD_ACTIVE1_range];
    /* 0x0058 */ uint64_t thread_active0a;
    /* 0x0059 */ uint64_t thread_active1a;
    /* 0x005A */ uint64_t thread_active0_rb;
    /* 0x005B */ uint64_t thread_active1_rb;
    /* 0x005C */ uint64_t reserve_005C[0x0064];
    /* 0x00C0 */ uint64_t glob_att[TESTINT_DCR__GLOB_ATT_range];
    /* 0x00C4 */ uint64_t reserve_00C4[0x000C];
    /* 0x00D0 */ uint64_t glob_att_mask;
    /* 0x00D1 */ uint64_t reserve_00D1[0x002F];
    /* 0x0100 */ uint64_t gp1_reg;
    /* 0x0101 */ uint64_t reserve_0101[0x000F];
    /* 0x0110 */ uint64_t gp2_reg[TESTINT_DCR__GP2_REG_range];
    /* 0x0114 */ uint64_t reserve_0114[0x000C];
    /* 0x0120 */ uint64_t gp3_reg;
    /* 0x0121 */ uint64_t reserve_0121[0x003F];
    /* 0x0160 */ uint64_t mailbox_reg0[TESTINT_DCR__MAILBOX_REG0_range];
    /* 0x0164 */ uint64_t reserve_0164[0x000C];
    /* 0x0170 */ uint64_t mailbox_reg1[TESTINT_DCR__MAILBOX_REG1_range];
    /* 0x0174 */ uint64_t reserve_0174[0x000C];
    /* 0x0180 */ uint64_t mailbox_reg2[TESTINT_DCR__MAILBOX_REG2_range];
    /* 0x0184 */ uint64_t reserve_0184[0x000C];
    /* 0x0190 */ uint64_t mailbox_reg3[TESTINT_DCR__MAILBOX_REG3_range];
    /* 0x0194 */ uint64_t reserve_0194[0x000C];
    /* 0x01A0 */ uint64_t parity;
    /* 0x01A1 */ uint64_t reserve_01A1[0x001F];
    /* 0x01C0 */ uint64_t redund_ctrl;
    /* 0x01C1 */ uint64_t reserve_01C1[0x000F];
    /* 0x01D0 */ uint64_t slice_sel_ctrl;
    /* 0x01D1 */ uint64_t reserve_01D1[0x002F];
    /* 0x0200 */ uint64_t usercode0[TESTINT_DCR__USERCODE0_range];
    /* 0x0204 */ uint64_t reserve_0204[0x000C];
    /* 0x0210 */ uint64_t usercode1[TESTINT_DCR__USERCODE1_range];
    /* 0x0214 */ uint64_t reserve_0214[0x000C];
    /* 0x0220 */ uint64_t usercode2[TESTINT_DCR__USERCODE2_range];
    /* 0x0224 */ uint64_t reserve_0224[0x000C];
    /* 0x0230 */ uint64_t usercode3[TESTINT_DCR__USERCODE3_range];
    /* 0x0234 */ uint64_t reserve_0234[0x000C];
    /* 0x0240 */ uint64_t Counter;
    /* 0x0241 */ uint64_t reserve_0241[0x000F];
    /* 0x0250 */ uint64_t gsync_ctr;
    /* 0x0251 */ uint64_t reserve_0251[0x00AF];
    /* 0x0300 */ uint64_t CLKTREE_CTRL0;
    /* 0x0301 */ uint64_t reserve_0301[0x000F];
    /* 0x0310 */ uint64_t CLKTREE_CTRL1;
    /* 0x0311 */ uint64_t reserve_0311[0x000F];
    /* 0x0320 */ uint64_t CLKTREE_CTRL2;
    /* 0x0321 */ uint64_t reserve_0321[0x000F];
    /* 0x0330 */ uint64_t CLKTREE_CTRL3;
    /* 0x0331 */ uint64_t reserve_0331[0x000F];
    /* 0x0340 */ uint64_t CLKTREE_CTRL4;
    /* 0x0341 */ uint64_t reserve_0341[0x000F];
    /* 0x0350 */ uint64_t CLKTREE_CTRL5;
    /* 0x0351 */ uint64_t reserve_0351[0x000F];
    /* 0x0360 */ uint64_t CLKTREE_CTRL6;
    /* 0x0361 */ uint64_t reserve_0361[0x000F];
    /* 0x0370 */ uint64_t CLKTREE_CTRL7;
    /* 0x0371 */ uint64_t reserve_0371[0x000F];
    /* 0x0380 */ uint64_t CLKTREE_CTRL8;
    /* 0x0381 */ uint64_t reserve_0381[0x000F];
    /* 0x0390 */ uint64_t CLKTREE_CTRL9;
    /* 0x0391 */ uint64_t reserve_0391[0x000F];
    /* 0x03A0 */ uint64_t CLKTREE_CTRL10;
    /* 0x03A1 */ uint64_t reserve_03A1[0x000F];
    /* 0x03B0 */ uint64_t CLKTREE_CTRL11;
    /* 0x03B1 */ uint64_t reserve_03B1[0x000F];
    /* 0x03C0 */ uint64_t CLKTREE_CTRL12;
    /* 0x03C1 */ uint64_t reserve_03C1[0x000F];
    /* 0x03D0 */ uint64_t CLKTREE_CTRL13;
    /* 0x03D1 */ uint64_t reserve_03D1[0x000F];
    /* 0x03E0 */ uint64_t CLKTREE_CTRL14;
    /* 0x03E1 */ uint64_t reserve_03E1[0x000F];
    /* 0x03F0 */ uint64_t CLKTREE_CTRL15;
    /* 0x03F1 */ uint64_t reserve_03F1[0x000F];
    /* 0x0400 */ uint64_t CLKTREE_CTRL16;
    /* 0x0401 */ uint64_t reserve_0401[0x000F];
    /* 0x0410 */ uint64_t CLKTREE_CTRL17;
    /* 0x0411 */ uint64_t reserve_0411[0x000F];
    /* 0x0420 */ uint64_t CLKTREE_CTRL18;
    /* 0x0421 */ uint64_t reserve_0421[0x00DF];
    /* 0x0500 */ uint64_t tvs_control;
    /* 0x0501 */ uint64_t reserve_0501[0x000F];
    /* 0x0510 */ uint64_t tvs_data;
    /* 0x0511 */ uint64_t reserve_0511[0x000F];
    /* 0x0520 */ uint64_t jmm_cntl;
    /* 0x0521 */ uint64_t reserve_0521[0x000F];
    /* 0x0530 */ uint64_t jmm_data[TESTINT_DCR__JMM_DATA_range];
    /* 0x0532 */ uint64_t reserve_0532[0x00CE];
    /* 0x0600 */ uint64_t ecid[TESTINT_DCR__ECID_range];
    /* 0x0632 */ uint64_t reserve_0632[0x19CE];
    /* 0x2000 */ uint64_t dcr_pcb_cntl;
    /* 0x2001 */ uint64_t dcr_pcb_data;
} testint_dcr_t;
  
#define TESTINT_DCR_USER_PTR _DCR_USER_PTR(testint_dcr_t, TESTINT_DCR)
#define TESTINT_DCR_PRIV_PTR _DCR_PRIV_PTR(testint_dcr_t, TESTINT_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
