/* begin_generated_IBM_copyright_prolog                             */
/*                                                                  */
/* This is an automatically generated copyright prolog.             */
/* After initializing,  DO NOT MODIFY OR MOVE                       */
/* ================================================================ */
/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (C) Copyright IBM Corp.  2010, 2012                              */
/*                                                                  */
/* US Government Users Restricted Rights -                          */
/* Use, duplication or disclosure restricted                        */
/* by GSA ADP Schedule Contract with IBM Corp.                      */
/*                                                                  */
/* This software is available to you under the                      */
/* Eclipse Public License (EPL).                                    */
/*                                                                  */
/* ================================================================ */
/*                                                                  */

#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define UPC_C_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

  
// Interrupt Control Register: upc_c_overflow_state_control_low
//   Permission: Read: All; Write: Privileged Only
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW_offset         (0x0841) // Offset of Control register in instance

#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__MODE2_DONE_width        2
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__MODE2_DONE_position     59
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__MODE2_DONE_get(x)       _BGQ_GET(2,59,x)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__MODE2_DONE_set(v)       _BGQ_SET(2,59,v)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__MODE2_DONE_insert(x,v)  _BGQ_INSERT(2,59,x,v)


#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__IO_COUNTER_OVF_width        2
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__IO_COUNTER_OVF_position     61
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__IO_COUNTER_OVF_get(x)       _BGQ_GET(2,61,x)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__IO_COUNTER_OVF_set(v)       _BGQ_SET(2,61,v)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__IO_COUNTER_OVF_insert(x,v)  _BGQ_INSERT(2,61,x,v)


#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__PROC_COUNTER_OVF_width        2
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__PROC_COUNTER_OVF_position     63
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__PROC_COUNTER_OVF_get(x)       _BGQ_GET(2,63,x)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__PROC_COUNTER_OVF_set(v)       _BGQ_SET(2,63,v)
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_LOW__PROC_COUNTER_OVF_insert(x,v)  _BGQ_INSERT(2,63,x,v)

  
// Interrupt Control Register: upc_c_overflow_state_control_high
//   Permission: Read: All; Write: Privileged Only
#define UPC_C_DCR__UPC_C_OVERFLOW_STATE_CONTROL_HIGH_offset         (0x0842) // Offset of Control register in instance
#ifndef __ASSEMBLY__

typedef struct upc_c_dcr { 
    /* 0x0000 */ uint64_t psram_data[UPC_C_DCR__PSRAM_DATA_range];
    /* 0x0400 */ uint64_t mode1_count[UPC_C_DCR__MODE1_COUNT_range];
    /* 0x0460 */ uint64_t reserve_0460[0x00A0];
    /* 0x0500 */ uint64_t psram_mode2_data[UPC_C_DCR__PSRAM_MODE2_DATA_range];
    /* 0x0600 */ uint64_t iosram_data[UPC_C_DCR__IOSRAM_DATA_range];
    /* 0x0700 */ uint64_t reserve_0700[0x0100];
    /* 0x0800 */ uint64_t config;
    /* 0x0801 */ uint64_t mode1_ec_config;
    /* 0x0802 */ uint64_t status;
    /* 0x0803 */ uint64_t mode1_counter_control0_rw;
    /* 0x0804 */ uint64_t mode1_counter_control0_w1s;
    /* 0x0805 */ uint64_t mode1_counter_control0_w1c;
    /* 0x0806 */ uint64_t mode1_counter_control1_rw;
    /* 0x0807 */ uint64_t mode1_counter_control1_w1s;
    /* 0x0808 */ uint64_t mode1_counter_control1_w1c;
    /* 0x0809 */ uint64_t mode1_counter_control2_rw;
    /* 0x080A */ uint64_t mode1_counter_control2_w1s;
    /* 0x080B */ uint64_t mode1_counter_control2_w1c;
    /* 0x080C */ uint64_t ccg_int_en;
    /* 0x080D */ uint64_t ccg_int_status_w1c;
    /* 0x080E */ uint64_t ccg_int_status_w1s;
    /* 0x080F */ uint64_t accum_control;
    /* 0x0810 */ uint64_t error_force;
    /* 0x0811 */ uint64_t m2_trigger;
    /* 0x0812 */ uint64_t counter_start;
    /* 0x0813 */ uint64_t reserve_0813[0x0009];
    /* 0x081C */ uint64_t io_ccg_int_en;
    /* 0x081D */ uint64_t io_ccg_int_status_w1c;
    /* 0x081E */ uint64_t io_ccg_int_status_w1s;
    /* 0x081F */ uint64_t reserve_081F;
    /* 0x0820 */ uint64_t upc_c_interrupt_state__state;
    /* 0x0821 */ uint64_t upc_c_interrupt_state_control_low;
    /* 0x0822 */ uint64_t upc_c_interrupt_state_control_high;
    /* 0x0823 */ uint64_t upc_c_interrupt_state__force;
    /* 0x0824 */ uint64_t upc_c_interrupt_state__first;
    /* 0x0825 */ uint64_t upc_c_interrupt_state__machine_check;
    /* 0x0826 */ uint64_t upc_c_interrupt_state__critical;
    /* 0x0827 */ uint64_t upc_c_interrupt_state__noncritical;
    /* 0x0828 */ uint64_t reserve_0828[0x0006];
    /* 0x082E */ uint64_t upc_io_sram_parity_info;
    /* 0x082F */ uint64_t upc_sram_parity_info;
    /* 0x0830 */ uint64_t interrupt_internal_error__state;
    /* 0x0831 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0832 */ uint64_t interrupt_internal_error__force;
    /* 0x0833 */ uint64_t interrupt_internal_error__first;
    /* 0x0834 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0835 */ uint64_t interrupt_internal_error__critical;
    /* 0x0836 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0837 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0838 */ uint64_t interrupt_internal_error_hw_info;
    /* 0x0839 */ uint64_t interrupt_internal_error_data_info;
    /* 0x083A */ uint64_t reserve_083A[0x0006];
    /* 0x0840 */ uint64_t upc_c_overflow_state__state;
    /* 0x0841 */ uint64_t upc_c_overflow_state_control_low;
    /* 0x0842 */ uint64_t upc_c_overflow_state_control_high;
    /* 0x0843 */ uint64_t upc_c_overflow_state__force;
    /* 0x0844 */ uint64_t upc_c_overflow_state__first;
    /* 0x0845 */ uint64_t upc_c_overflow_state__machine_check;
    /* 0x0846 */ uint64_t upc_c_overflow_state__critical;
    /* 0x0847 */ uint64_t upc_c_overflow_state__noncritical;
} upc_c_dcr_t;
  
#define UPC_C_DCR_USER_PTR _DCR_USER_PTR(upc_c_dcr_t, UPC_C_DCR)
#define UPC_C_DCR_PRIV_PTR _DCR_PRIV_PTR(upc_c_dcr_t, UPC_C_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
